
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ДвиженияМонет 
	Движения.ДвиженияМонет.Записывать = Истина;
	Для Каждого ТекСтрокаМонеты Из Монеты Цикл
		Движение = Движения.ДвиженияМонет.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
		Движение.Период 			= Дата;
		Движение.Объект 			= ТекСтрокаМонеты.Монета;
		Движение.Коллекция 			= КоллекцияТекущая;
		Движение.Количество 		= ТекСтрокаМонеты.Количество;
		Движение.Стоимость			= ТекСтрокаМонеты.Стоимость;
		//
		Движение = Движения.ДвиженияМонет.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
		Движение.Период 			= Дата;
		Движение.Объект 			= ТекСтрокаМонеты.Монета;
		Движение.Коллекция 			= КоллекцияПриемник;
		Движение.Количество 		= ТекСтрокаМонеты.Количество;
		Движение.Стоимость			= ТекСтрокаМонеты.Стоимость;
		
	КонецЦикла;

КонецПроцедуры
