
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//
	Поля.Добавить ("Наименование");
	Поля.Добавить ("Буквы");
	Поля.Добавить ("ЭтоГруппа");
	Поля.Добавить ("ГодНачала");
	Поля.Добавить ("ГодОкончания");
	//
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	//
	Если Данные.ЭтоГруппа Тогда
		Представление 		= Данные.Наименование;	
	Иначе	
		Представление 		= Данные.Буквы + " - " + Данные.Наименование;
		Если Данные.ГодНачала = Данные.ГодОкончания Тогда
			Представление     = Представление + " ("+ Формат (Данные.ГодНачала, "ЧГ=0") + " г.)"
		Иначе
			Представление     = Представление + " ("+ Формат (Данные.ГодНачала, "ЧГ=0") + "-" + Формат (Данные.ГодОкончания, "ЧГ=0") + " гг.)"
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры
