
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Период") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("НаДату", Параметры.Период);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	//СтруктураВозврата = ПриЗакрытииНаСервере();
	//ОповеститьОВыборе(СтруктураВозврата);
КонецПроцедуры

&НаСервере
Функция ПриЗакрытииНаСервере()
	
	//СтруктураВозврата = Новый Структура();
	//
	//АдресПодобранныхМонетВХранилище = ПоместитьПодобранныеМонетыВХранилище();
	//СтруктураВозврата.Вставить("АдресПодобранныхМонетВХранилище", АдресПодобранныхМонетВХранилище);
	//
	//Возврат СтруктураВозврата;
	
КонецФункции

&НаСервере
Функция ПоместитьПодобранныеМонетыВХранилище()
	
	ТаблицаМонет = Новый ТаблицаЗначений;
	ТаблицаМонет.Колонки.Добавить("Монета", Новый ОписаниеТипов("СправочникСсылка.Монеты"));
	Для Каждого Строка ИЗ Элементы.Список.ВыделенныеСтроки Цикл
		НоваяМонета = ТаблицаМонет.Добавить();
		НоваяМонета.Монета = Строка.Ссылка
	КонецЦикла;	
	
	АдресПодобранныхМонетВХранилище = ПоместитьВоВременноеХранилище(ТаблицаМонет, УникальныйИдентификатор);
	
	Возврат АдресПодобранныхМонетВХранилище;
	
КонецФункции
