Процедура ОбновитьИнформациюПоТреку (ПочтовоеОтправление, ТочкиМаршрута) Экспорт
	
	Если ТипЗнч (ТочкиМаршрута) = Тип("Массив") И ТочкиМаршрута.Количество () <= 0 Тогда
		Возврат
	КонецЕсли;	
	
	НЗ = РегистрыСведений.ПочтовыеТреки.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить (ПочтовоеОтправление);
	НЗ.Прочитать();
	НЗ.Очистить();
	//
	ПредыдущийПериод = Дата (1,1,1);
	//
	Для Каждого Точка ИЗ ТочкиМаршрута Цикл
		
		НоваяЗапись						= НЗ.Добавить();
		
		Если ПредыдущийПериод = Дата (1,1,1) Тогда
			ПредыдущийПериод 			= Точка.Дата
		ИначеЕсли ПредыдущийПериод = Точка.Дата Тогда
			Точка.Дата 					= Точка.Дата + 1;
		КонецЕсли;	
		
		НоваяЗапись.Период				= Точка.Дата;
		НоваяЗапись.Документ 			= ПочтовоеОтправление;
		НоваяЗапись.Индекс				= Точка.Индекс;
		НоваяЗапись.ПочтовоеОтделение	= Точка.Описание;
		Если Точка.Свойство ("Операция") Тогда
			НоваяЗапись.Операция		= Точка.Операция;
		КонецЕсли;	
		Если Точка.Свойство ("Статус") Тогда
			НоваяЗапись.Статус			= Точка.Статус;
		КонецЕсли;
	КонецЦикла;	
	
	Попытка
		НЗ.Записать ();
	Исключение
		Инфо = ИнформацияОбОшибке();
		ПодробнаяИнформацияОбОшибке = ПодробноеПредставлениеОшибки(Инфо); 
		ЗаписьЖурналаРегистрации("ОтслеживаниеПочтовыхОтправлений", УровеньЖурналаРегистрации.Ошибка, , , ПодробнаяИнформацияОбОшибке)
	КонецПопытки;	
	
КонецПроцедуры	