
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	////
	//Поля.Добавить ("Наименование");
	//Поля.Добавить ("ГодНачала");
	//Поля.Добавить ("ГодОкончания");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	////
	//Представление = Данные.Наименование + " (" + Формат (Данные.ГодНачала, "ЧГ=0") + "-" + Формат (Данные.ГодОкончания, "ЧГ=0") + ")";
	
КонецПроцедуры
