
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПочтовоеОтправление = ПолучитьИнформациюОбОтправлении (ПараметрКоманды);
	Если ПочтовоеОтправление <> Неопределено Тогда
		Если НЕ ПочтовоеОтправление.ВрученАдресату Тогда
			
			Треки = ПолучитьИнформациюПоТреку (ПочтовоеОтправление.ПочтовыйИдентификатор);
		
			Если Треки.Количество () > 0 Тогда
				ЗаписатьИнформациюПоТрекам (ПараметрКоманды, Треки);
			КонецЕсли;
		КонецЕсли;
	
		ТекстСообщения = НСтр("ru = 'Проверка трека по почтовому идентификатору завершена.'"); 
		ПоказатьОповещениеПользователя(НСтр("ru = 'Проверка завершена!'"), , ТекстСообщения, БиблиотекаКартинок.Информация32);
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'У документа отсутствует почтовый идентификатор!'"); 
		ПоказатьОповещениеПользователя(НСтр("ru = 'Проверка завершена!'"), , ТекстСообщения, БиблиотекаКартинок.Информация32);
		Возврат
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПочтовыйИдентификатор (ДокСсылка)
	Возврат РегистрыСведений.ПочтовыеИдентификаторы.ПолучитьПочтовыйИдентификатор(ДокСсылка);	
КонецФункции	

&НаСервере
Функция ПолучитьИнформациюОбОтправлении (ДокСсылка)
	Возврат РегистрыСведений.ПочтовыеИдентификаторы.ПолучитьИнформациюОПочтовомОтправлении(ДокСсылка);	
КонецФункции	

&НаСервере
Процедура ЗаписатьПараметрыПочтовогоОтправления (Параметры)
	
	РегистрыСведений.ПочтовыеИдентификаторы.ЗаписатьПараметрыПочтовогоОтправления(Параметры);	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИнформациюПоТрекам (ДокСсылка, МассивТреков)
	
	РегистрыСведений.ПочтовыеТреки.ОбновитьИнформациюПоТреку (ДокСсылка, МассивТреков);	
	
	РаботаСПочтовымиОтправлениями.ОповеститьОбИзмененииСтатуса(ДокСсылка); 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИнформациюПоТреку (ПочтовыйИдентификатор)
	Если Константы.ИспользоватьСервисПочтыРФ.Получить() Тогда
		Возврат РаботаСПочтовымиОтправлениями.ОтслеживаниеРПО (ПочтовыйИдентификатор);
	Иначе	
		Возврат РаботаСПочтовымиОтправлениями.ПолучитьИнформациюПоТрекуНаСервере (ПочтовыйИдентификатор);
	КонецЕсли;	
КонецФункции	