
Процедура ОтслеживаниеПочтовыхОтправлений() Экспорт
	
	ЗаписьЖурналаРегистрации("ОтслеживаниеПочтовыхОтправлений", УровеньЖурналаРегистрации.Информация,,,"Начало проверки.");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 10
		|	ПочтовыеИдентификаторы.Документ,
		|	ПочтовыеИдентификаторы.ПочтовыйИдентификатор
		|ИЗ
		|	РегистрСведений.ПочтовыеИдентификаторы КАК ПочтовыеИдентификаторы
		|ГДЕ
		|	НЕ ПочтовыеИдентификаторы.ВрученАдресату";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПочтовоеОтправление = РегистрыСведений.ПочтовыеИдентификаторы.ПолучитьИнформациюОПочтовомОтправлении(Выборка.Документ);
		Если ПочтовоеОтправление <> Неопределено Тогда
			Если НЕ ПочтовоеОтправление.ВрученАдресату Тогда
				Если Константы.ИспользоватьСервисПочтыРФ.Получить() Тогда
					Треки = РаботаСПочтовымиОтправлениями.ОтслеживаниеРПО(ПочтовоеОтправление.ПочтовыйИдентификатор);
				Иначе	
					Треки = РаботаСПочтовымиОтправлениями.ПолучитьИнформациюПоТрекуНаСервере (ПочтовоеОтправление.ПочтовыйИдентификатор);
				КонецЕсли;
			
				Если Треки.Количество () > 0 Тогда
					РегистрыСведений.ПочтовыеТреки.ОбновитьИнформациюПоТреку (Выборка.Документ, Треки);	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("ОтслеживаниеПочтовыхОтправлений", УровеньЖурналаРегистрации.Информация,,,"Окончание проверки.");

КонецПроцедуры

