Процедура ПередЗаписью(Отказ, Замещение)
	
	ВалютаУчета = Константы.ОсновнаяУчетнаяВалюта.Получить();
	
	Для Каждого ТекЗапись ИЗ ЭтотОбъект цикл
		Если (НЕ ВалютаУчета.Пустая()) И (ТекЗапись.Валюта <> ВалютаУчета) Тогда 
			// надо прессчитать из валюты в  основную учетную валюту
			СуммаВВалютеУчета 		= РаботаСКурсамиВалют.ПересчитатьВВалюту (ТекЗапись.Сумма, ТекЗапись.Валюта, ВалютаУчета, ТекЗапись.Период);
			ТекЗапись.ВалютнаяСумма = ТекЗапись.Сумма;
			ТекЗапись.Сумма			= СуммаВВалютеУчета;
		КонецЕсли;	
	КонецЦикла;

КонецПроцедуры

