Функция ПолучитьИнформациюПоОбъекту (ОбъектСсылка, Период = '0001-01-01') Экспорт
	
	Если Период = Дата (1,1,1) Тогда
		Период = ТекущаяДата()
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвиженияМонетОстатки.Коллекция,
		|	ДвиженияМонетОстатки.КоличествоОстаток,
		|	ДвиженияМонетОстатки.СтоимостьОстаток
		|ИЗ
		|	РегистрНакопления.ДвиженияМонет.Остатки(&НаДату, Объект = &ОбъектСсылка) КАК ДвиженияМонетОстатки";
	
	Запрос.УстановитьПараметр("ОбъектСсылка", ОбъектСсылка);
	Запрос.УстановитьПараметр("НаДату", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Информация = Новый Структура;
	
	Если Выборка.Следующий() Тогда
		Информация.Вставить("Коллекция", Выборка.Коллекция);
		Информация.Вставить("Количество", Выборка.КоличествоОстаток);
		Информация.Вставить("Стоимость", Выборка.СтоимостьОстаток);
	КонецЕсли;
	
	Возврат Информация
	
КонецФункции

Функция ПолучитьСтоимостьКоллекции (Коллекционер, Период = '0001-01-01') Экспорт
	
	Если Период = Дата (1,1,1) Тогда
		Период = ТекущаяДата()
	КонецЕсли;	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвиженияМонетОстатки.Коллекция.Коллекционер КАК Коллекционер,
		|	СУММА(ДвиженияМонетОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	СУММА(ДвиженияМонетОстатки.СтоимостьОстаток) КАК СтоимостьОстаток
		|ИЗ
		|	РегистрНакопления.ДвиженияМонет.Остатки(&НаДату, Коллекция.Коллекционер = &Коллекционер) КАК ДвиженияМонетОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ДвиженияМонетОстатки.Коллекция.Коллекционер";
	
	Запрос.УстановитьПараметр("Коллекционер", Коллекционер);
	Запрос.УстановитьПараметр("НаДату", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Остаток = 0;
	
	Если Выборка.Следующий() Тогда
		Остаток = Выборка.СтоимостьОстаток;
	КонецЕсли;
	
	Возврат Остаток

КонецФункции	