
&НаКлиенте
Процедура Пример1Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СохранитьПримерИзображения (Элемент)
КонецПроцедуры

&НаКлиенте
Процедура Пример2Нажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СохранитьПримерИзображения (Элемент)
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПримерИзображения (Элемент)
	
	ИмяФайлаКартинки = "";
	
	РасширениеПодключено = ПодключитьРасширениеРаботыСФайлами();
	Если РасширениеПодключено Тогда
		Режим 										= РежимДиалогаВыбораФайла.Открытие;
		ДиалогОткрытияФайла 						= Новый ДиалогВыбораФайла(Режим);
		ДиалогОткрытияФайла.ПредварительныйПросмотр	= Ложь;
		ДиалогОткрытияФайла.Фильтр 					= "Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf|" 
													+ "Формат bmp (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
													+ "Формат JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
													+ "Формат TIFF (*.tif)|*.tif|"
													+ "Формат GIF (*.gif)|*.gif|"
													+ "Формат PNG (*.png)|*.png|"
													+ "Формат icon (*.ico)|*.ico|"
													+ "Формат метафайл (*.wmf;*.emf)|*.wmf;*.emf|"; 
		ДиалогОткрытияФайла.МножественныйВыбор 		= Ложь;
		ДиалогОткрытияФайла.Заголовок 				= НСтр("ru = 'Выбор файла картинки'");
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			ИмяФайлаКартинки = ДиалогОткрытияФайла.ПолноеИмяФайла;
		КонецЕсли;
	
	КонецЕсли;		
	
	ФайлКартинки = Новый Файл (ИмяФайлаКартинки);
	Если ФайлКартинки.Существует() Тогда
		Картинка = Новый ДвоичныеДанные (ИмяФайлаКартинки);
		СохранитьКартинку (Элемент.Имя, Картинка);	
	Иначе
		Состояние ("Загрузка файла картинки",,"Возникла ошибка при загрузке картинки!", БиблиотекаКартинок.Ошибка32);
		Возврат
	КонецЕсли;
	//
	АдресИзображенияПример1 = ПолучитьНавигационнуюСсылку (Объект.Ссылка, "Пример1");
	АдресИзображенияПример2 = ПолучитьНавигационнуюСсылку (Объект.Ссылка, "Пример2");
	//
	Элементы.Пример1.Обновить();
	Элементы.Пример2.Обновить();
	//
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//
	АдресИзображенияПример1 = ПолучитьНавигационнуюСсылку (Объект.Ссылка, "Пример1");
	АдресИзображенияПример2 = ПолучитьНавигационнуюСсылку (Объект.Ссылка, "Пример2");
	//
КонецПроцедуры

&НаСервере
Процедура СохранитьКартинку (Элемент, ДвоичныеДанные)

	ТекушийОбъект = РеквизитФормыВЗначение("Объект");
	Если Элемент = "Пример1" Тогда
		ТекушийОбъект.Пример1 = Новый ХранилищеЗначения (ДвоичныеДанные);
	ИначеЕсли Элемент = "Пример2" Тогда	
		ТекушийОбъект.Пример2 = Новый ХранилищеЗначения (ДвоичныеДанные);
	КонецЕсли;
	ТекушийОбъект.Записать ();
	ЗначениеВРеквизитФормы(ТекушийОбъект, "Объект");

КонецПроцедуры

