
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НеОтображатьМонету") Тогда
		Элементы.Монета.Видимость = Ложь
	КонецЕсли;	
	
	Если Параметры.Свойство("Монета") Тогда
		Запись.Монета 	= Параметры.Монета;
	КонецЕсли;
	
	Если Параметры.Свойство("Номер") Тогда
		Запись.Номер = Параметры.Номер	
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить ("ЗаписанНомерВКоллекции")
КонецПроцедуры
