Процедура ЗаписатьНомер (Монета, Номер) Экспорт
	
	ТекущийНомер = ПолучитьНомер (Монета);
	Если Номер = ТекущийНомер Тогда
		Возврат
	КонецЕсли;	
	
	НЗ = РегистрыСведений.НомерВКоллекции.СоздатьНаборЗаписей();
	НЗ.Отбор.Монета.Установить (Монета);
	НЗ.Прочитать ();
	НЗ. Очистить ();
	
	НоваяЗапись 			= НЗ.Добавить();
	НоваяЗапись.Монета 	= Монета;
	НоваяЗапись.Номер		= Номер;
	
	НЗ.Записать ();
	
КонецПроцедуры	

Функция ПолучитьНомер (Монета) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НомерВКоллекции.Номер
		|ИЗ
		|	РегистрСведений.НомерВКоллекции КАК НомерВКоллекции
		|ГДЕ
		|	НомерВКоллекции.Монета = &Монета";
	
	Запрос.УстановитьПараметр("Монета", Монета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Номер
	Иначе
		Возврат 0
	КонецЕсли;
	
КонецФункции	