
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПолучитьСсылкуНаКартинку ()
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСсылкуНаКартинку ()
	
	Если Элементы.Список.ТекущаяСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если ОтображатьКартинки Тогда
		АдресКартинки = ПолучитьНавигационнуюСсылку (Элементы.Список.ТекущаяСтрока, "Картинка");
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаКартинки.Видимость = ОтображатьКартинки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьКартинкиПриИзменении(Элемент)
	
	Элементы.ГруппаКартинки.Видимость = ОтображатьКартинки;
	ПолучитьСсылкуНаКартинку ()
	
КонецПроцедуры
