
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда // новый
		Объект.Коллекционер 	= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеПоКоллекции(Команда)
	
	УсловияОтбора = Новый Структура;
	//УсловияОтбора.Вставить ("НаДату", ТекущаяДата());
	УсловияОтбора.Вставить ("Коллекция", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	ОткрытьФорму("Отчет.ДвиженияМонет.Форма", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры
