Функция ПолучитьСуммуДопРасходов (Коллекционер, Период = '0001-01-01') Экспорт
	
	Если Период = Дата (1,1,1) Тогда
		Период = ТекущаяДата()
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеРасходыОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ДополнительныеРасходы.Остатки(&НаДату, Коллекционер = &Коллекционер) КАК ДополнительныеРасходыОстатки";
	
	Запрос.УстановитьПараметр("Коллекционер", Коллекционер);
	Запрос.УстановитьПараметр("НаДату", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Остаток = 0;
	
	Если Выборка.Следующий() Тогда
		Остаток = Выборка.СуммаОстаток;
	КонецЕсли;

	Возврат Остаток
	
КонецФункции	