
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ДополнительныеРасходы Приход
	Движения.ДополнительныеРасходы.Записывать = Истина;
	Движение = Движения.ДополнительныеРасходы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Коллекционер = Коллекционер;
	Движение.Сумма = СуммаДокумента;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(Коллекционер) Тогда
		Коллекционер = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	

КонецПроцедуры
