
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(Коллекционер) Тогда
		Коллекционер = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
	
	СуммаДокумента = Список.Итог("Цена");

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Планирование
	Движения.Планирование.Записывать = Истина;
	Для Каждого ТекСтрокаСписок Из Список Цикл
		Движение 				= Движения.Планирование.Добавить();
		Движение.Коллекционер 	= Коллекционер;
		Движение.Коллекция 		= Коллекция;
		Движение.ВидМонеты 		= ТекСтрокаСписок.ВидМонеты;
		Движение.Количество 	= 1;
		Движение.Сумма 			= ТекСтрокаСписок.Цена;
	КонецЦикла;

КонецПроцедуры
