
&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИмяФайлаКартинки = "";
	
	РасширениеПодключено = ПодключитьРасширениеРаботыСФайлами();
	Если РасширениеПодключено Тогда
		Режим 										= РежимДиалогаВыбораФайла.Открытие;
		ДиалогОткрытияФайла 						= Новый ДиалогВыбораФайла(Режим);
		ДиалогОткрытияФайла.ПредварительныйПросмотр	= Ложь;
		ДиалогОткрытияФайла.Фильтр 					= "Все картинки (*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf)|*.bmp;*.dib;*.rle;*.jpg;*.jpeg;*.tif;*.gif;*.png;*.ico;*.wmf;*.emf|" 
													+ "Формат bmp (*.bmp;*.dib;*.rle)|*.bmp;*.dib;*.rle|"
													+ "Формат JPEG (*.jpg;*.jpeg)|*.jpg;*.jpeg|"
													+ "Формат TIFF (*.tif)|*.tif|"
													+ "Формат GIF (*.gif)|*.gif|"
													+ "Формат PNG (*.png)|*.png|"
													+ "Формат icon (*.ico)|*.ico|"
													+ "Формат метафайл (*.wmf;*.emf)|*.wmf;*.emf|"; 
		ДиалогОткрытияФайла.МножественныйВыбор 		= Ложь;
		ДиалогОткрытияФайла.Заголовок 				= НСтр("ru = 'Выбор файла картинки'");
		Если ДиалогОткрытияФайла.Выбрать() Тогда
			ИмяФайлаКартинки = ДиалогОткрытияФайла.ПолноеИмяФайла;
		КонецЕсли;
	
	КонецЕсли;		
	
	ФайлКартинки = Новый Файл (ИмяФайлаКартинки);
	Если ФайлКартинки.Существует() Тогда
		Картинка = Новый ДвоичныеДанные (ИмяФайлаКартинки);
		СохранитьКартинку (Картинка);	
	Иначе
		Состояние ("Загрузка файла картинки",,"Возникла ошибка при загрузке картинки!", БиблиотекаКартинок.Ошибка32);
		Возврат
	КонецЕсли;
	//
	АдресКартинки = ПолучитьНавигационнуюСсылку (Объект.Ссылка, "Изображение");
	//
	Элементы.Картинка.Обновить();
	//
КонецПроцедуры

&НаСервере
Процедура СохранитьКартинку(ДвоичныеДанные)
	
	ТекушийОбъект 				= РеквизитФормыВЗначение("Объект");
	ТекушийОбъект.Изображение 	= Новый ХранилищеЗначения (ДвоичныеДанные);
	ТекушийОбъект.Записать ();
	ЗначениеВРеквизитФормы(ТекушийОбъект, "Объект");

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//
	АдресКартинки = ПолучитьНавигационнуюСсылку (Объект.Ссылка, "Изображение");
	//
КонецПроцедуры
