
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПолучитьСсылкиКартинок ();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПримерПриИзменении(Элемент)
	
	Элементы.ГруппаИзображений.Видимость = ОтображатьПример;
	ПолучитьСсылкиКартинок ();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСсылкиКартинок ()
	Если ОтображатьПример Тогда
		АдресКартинкиПример1 = ПолучитьНавигационнуюСсылку (Элементы.Список.ТекущаяСтрока, "Пример1");
		АдресКартинкиПример2 = ПолучитьНавигационнуюСсылку (Элементы.Список.ТекущаяСтрока, "Пример2");
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ГруппаИзображений.Видимость = ОтображатьПример;
	
КонецПроцедуры
